const Contents = {
  inputs: {
    name: "",
    title: "",
    content: ""
  },
  datas: [
    {
      id: 1,
      name: "관리자",
      title:
        "2023.8.21. (월) 기상청 폭염 주의보에 따른 경복궁 정규 해설 운영 조정 알림",
      content:
        "기상청 폭염 주의보 발효에 따라 경복궁 정규 해설을 다음과 같이  조정하여 운영함을 알려드리니 관람에 참고하시기 바랍니다. \n\n ﻿○ 일 자 : 2023. 8. 21. (월) \n ﻿○ 조정내용 : 경복궁 흥례문 ~ 경회루 권역 30분 내외 해설 단축 운영",
      createDate: "2023-08-21",
    },
    {
      id: 2,
      name: "관리자",
      title:
        "2023.8.23. (수) 기상청 호우 주의보에 따른 경복궁 정규 해설 운영 조정 알림",
      content:
        "기상청 호우 주의보 발효에 따라 경복궁 정규 해설을 다음과 같이  조정하여 운영함을 알려드리니 관람에 참고하시기 바랍니다. \n\n ﻿○ 일 자 : 2023. 8. 23. (수) \n ﻿○ 조정내용 : 경복궁 흥례문 ~ 경회루 권역 30분 내외 해설 단축 운영",
      createDate: "2023-08-23",
    },
    {
      id: 3,
      name: "관리자",
      title:
        "광화문 월대 복원공사에 따른 광화문 전면 폐쇄 및 보행로 변경 알림(9.4.(월)~10.15(일))",
      content: 
        "광화문 월대 복원공사의 원활한 진행 및 보행자 안전관리를 위하여  광화문 출입 전면 폐쇄 및 보행로가 변경되오니 관람시 참고하시기 바랍니다. \n\n - 기간 : 2023년 9월 4일 (월) ~ 10월 15일 (일) \n ＊추후 공사 일정에 따라 변경될 수 있음 \n\n - 변경 보행로 : 경복궁역 5번 출구 및 고궁박물관 정문 쪽 출입문 (경복궁 용성문) 또는 경복궁 주차장쪽 출입문 (경복궁 협생문) \n ※ 야간관람 시에도 광화문 출입 전면 폐쇄 및 보행로 변경 유지 \n ※ 수문장 교대의식 행사 동선 변경 \n ※ 자세한 관람로는 첨부파일 참조 \n\n 월대 복원공사로 인한 경복궁 관람에 불편을 드려 죄송하며 양해하여 주시기 바랍니다.",
      createDate: "2023-09-03",
    },
    {
      id: 4,
      name: "관리자",
      title: "2023년 9월~10월 경복궁, 칠궁 관람 안내",
      content:
        "2023년 ﻿9월~10월 경복궁, 칠궁 관람을 다음과 같이 알려드리니 관람에 참고하시기 바랍니다. \n\n ※ 2023. 9. 28.(목) ~ 10. 3.(화) \n - 추석연휴 및 공휴일 기간 경복궁·칠궁 무료 개방 \n\n ※ 야간관람은 유료 (10.2, 10.3, 10.4. 야간관람 미운영) \n - 경회루 특별관람 및 경복궁 정규해설 미운영 \n\n ※ 10. 1.(일) 경복궁 정규해설 운영 (한국어 해설 운영시간 - 10:00, 11:00, 13:00, 14:00, 15:00 / 외국어 해설 운영) \n\n ※ 2023. 10. 4.(수) \n - 경복궁·칠궁 휴무 \n\n ※ 2023. 10. 9.(월) 한글날 \n- 경복궁·칠궁 정상 개방 (야간관람 미운영) \n - 경회루 특별관람 및 경복궁 정규해설 미운영 \n\n ※ 「궁·능 관람 등에 관한 규정」 제3조(공개)제3항, 제3조의2(비공개)제2항에 따라 경복궁과 칠궁은 10.3.(화) 정상 개방하며, 10.4.(수) 휴무일로 변경됨을 알려드립니다.",
      createDate: "2023-09-13",
    },
    {
      id: 5,
      name: "관리자",
      title: "‘왕세자의 공간’ 경복궁 계조당 복원 완료 알림",
      content:
        "경복궁 계조당 복원 완료를 다음과 같이 알려드리니 관람에 참고하시기 바랍니다. \n\n - 전통재료와 기법으로 계조당 본당, 행각 등 복원 마쳐 … 9월 20일부터 일반에 공개 \n\n 문화재청 궁능유적본부(본부장 직무대리 신성희)는 2018년부터 추진해온 경복궁 계조당 복원사업을 마무리하고 9월 20일부터 복원한 계조당 권역을 국민에게 공개한다. 계조당은 왕세자의 공간인 경복궁 동쪽에 자리잡은 동궁(東宮) 권역의 일부로서, 세종을 대리하여 정무를 맡았던 세자(문종)가 사용했던 건물이다. 특히, 신하가 왕세자에게 조하(朝賀)를 드리고 진찬(進饌)을 여는 등 동궁 정당(正堂)으로서의 기능뿐만 아니라 조선 왕조의 권위와 후계의 연속성을 상징하는 중요한 공간으로 활용되었으나 일제강점기인 1910년경 훼철되었다. \n * 조하(朝賀): 조정에 나아가 왕이나 왕세자에게 축하하며 예의를 보임 \n * 진찬(進饌): 궁중 잔치의 하나로 음식을 올림 \n\n 이번에 복원한 계조당 권역은 정면 5칸, 측면 3칸 규모의 본당, 의례에 필요한 월대, 주변부 행각과 담장 그리고 외곽 담장부에 봉의문이다. 문화재청은 복원과정에서 다양한 고증자료를 수집하고 관계전문가의 검토를 거쳤으며, 목재·석재·기와 등도 문화유산 수리장인이 손수 제작·가공하는 등 전통재료와 기법을 충실히 적용하였다. \n * 행각(行閣) : 건물 앞이나 좌우에 지은 긴 장랑(줄행랑) \n\n 복원 완료된 계조당 권역은 경복궁 관람객이라면 누구나 별도의 사전 신청 없이 관람할 수 있다. 계조당 권역 관람을 통해 우리 전통 궁궐건축의 아름다움과 장인의 손길 그리고 조선 법궁의 품격을 느낄 수 있는 소중한 기회가 될 것이다. 이와 더불어 계조당 복원 의의와 전각의 역사성을 알리는 상설전시와 교육·체험 프로그램이 11월 중 운영될 예정이다. \n * 법궁(法宮): 임금이 거처하는 공식적인 궁궐 가운데 으뜸이 되는 궁궐 \n\n 문화재청 궁능유적본부는 앞으로도 경복궁을 포함한 궁·능 복원정비사업을 지속적으로 추진하여, 궁능의 고유 가치를 보존·계승하고, 국민을 위한 다양한 역사문화환경을 조성해나갈 예정이다.",
      createDate: "2023-09-20",
    },
    {
      id: 6,
      name: "관리자",
      title:
        "2023.10.15. (일) 경복궁 내부사정으로 인한 2023 가을 야간관람 휴무 알림",
      content:
        "경복궁 내부 사정으로 인하여  2023.10.15.(일) 경복궁 가을 야간관람 휴무를 공지하오니  관람에 참고하시기 바라며 양해해 주시기 바랍니다.",
      createDate: "2023-09-24",
    },
    {
      id: 7,
      name: "관리자",
      title:
        "2023.10.17. (화) 궁중문화축전 기간에 따른 휴궁일 경복궁 개방(유료) 안내",
      content:
        "2023.10.17.(화) 궁중문화축전 기간에 따른 휴궁일 경복궁 개방(유료)을 알려드리니  관람에 참고하시기 바랍니다. \n\n - 관람가능 일시 : 2023.10.17.(화) 09:00~18:00 (유료) \n - 정규해설 및 경회루 특별관람, 집옥재 작은도서관 미운영 \n - 야간관람 미운영",
      createDate: "2023-09-26",
    },
    {
      id: 8,
      name: "관리자",
      title: "홈페이지 일시 중단 알림 (10.25 (수) 13:30)",
      content:
        "경복궁 홈페이지 일시 중단 알림(10.25.(수)) \n\n ° 작업내용: ​대한민국 밤산책 홈페이지 전산작업(웹방화벽 강화) \n ° 일시: 2023. 10. 25.(수) 13:30 ~ 13:40 \n ​° 영향: 대한민국 밤산책 홈페이지 접속 불가 13:30 ~ 13:40(10분 이내)",
      createDate: "2023-10-25",
    },
    {
      id: 9,
      name: "관리자",
      title: "2023년 12월 ~ 2024년 1월 경복궁, 칠궁 관람 안내",
      content:
        "2023년 12월~2024년 1월 경복궁·칠궁 개방을 다음과 같이 안내하오니 관람에 참고하시기 바랍니다. \n\n -2023.12.25.(월) 성탄절 : 경복궁·칠궁 정상 개방(유료) \n ＊정규 해설 미운영 \n\n -2023.12.26.(화) 경복궁·칠궁 정규 휴궁일 \n\n -2024.1.1.(월) 신정 : 경복궁·칠궁 정상 개방(유료) \n ＊정규 해설 미운영 \n\n -2024.1.2.(화) 경복궁·칠궁 정규 휴궁일",
      createDate: "2023-12-08",
    },
    {
      id: 10,
      name: "관리자",
      title: "경복궁 자경전 관람제한 안내",
      content:
        "자경전 관람제한 안내 \n\n 화재예방을 위한 소방설비공사로 인하여 일시적으로 자경전 관람을 제한하오니 양해하여 주시기 바랍니다.",
      createDate: "2023-12-08",
    },
    {
      id: 11,
      name: "관리자",
      title:
        "2023.12.22. (금) 기상청 한파 주의보에 따른 경복궁 정규 해설 운영 조정 알림",
      content:
        "기상청 한파 주의보 발효에 따라 경복궁 정규 해설을 다음과 같이 조정하여 운영함을 알려드리니 관람에 참고하시기 바랍니다. \n\n ○ 일      자 : 2023. 12. 22. (금) \n\n ○ 조정내용 : 경복궁 흥례문 ~ 교태전 권역 50분 내외 해설 단축 운영",
      createDate: "2023-12-28",
    },
    {
      id: 12,
      name: "관리자",
      title:
        "2023.12.23. (토) 기상청 한파 주의보에 따른 경복궁 정규 해설 운영 조정 알림",
      content:
        "기상청 한파 주의보 발효에 따라 경복궁 정규 해설을 다음과 같이 조정하여 운영함을 알려드리니 관람에 참고하시기 바랍니다. \n\n ○ 일      자 : 2023. 12. 23. (토) \n\n ○ 조정내용 : 경복궁 흥례문 ~ 교태전 권역 50분 내외 해설 단축 운영",
      createDate: "2023-12-28",
    },
    {
      id: 13,
      name: "관리자",
      title: "2024년 설 연휴 기간에 따른 경복궁 및 칠궁 개방일과 휴궁일 안내",
      content:
        "2024년 설 연휴 기간에 따른 경복궁 및 칠궁 개방일과 휴궁일을 다음과 같이 알려드리니 관람에 참고하시기 바랍니다. \n\n - 설 연휴 기간 : [2024. 2. 9.(금) ~ 2. 12.(월)] \n\n - 개방일 : 2024. 2. 9.(금) ~ 2. 12.(월) \n ※ 무료 개방 \n\n - 관람 시간 : 09:00~17:00 \n - 입장마감 시간 : 경복궁 - 16:00 / 칠궁 - 16:30 \n\n - 경복궁·칠궁 해설 : 정규해설 없음 \n\n - 휴궁일 : 2024. 2. 13.(화) \n ※ 매주 화요일 경복궁·칠궁 정규 휴궁일 \n\n - 관람 문의 : 02-3700-3900",
      createDate: "2024-01-20",
    },
    {
      id: 14,
      name: "관리자",
      title: "2024 경복궁 집옥재 작은도서관 개방 안내",
      content:
        "고종의 서재로 사용되었던 경복궁 집옥재를 작은도서관으로 개방합니다. \n 독서와 휴식의 역사문화체험공간이 될 수 있도록 관람객 여러분들의 많은 협조 바랍니다. \n\n ㅇ 개방기간: 2024. 4. 3.(수) ~ 10. 31.(목) \n ※ 매주 화요일, 7~8월, 추석연휴(9.16.~18.), 문화행사가 있는 날(추후공지) 휴관 \n\n ㅇ 관람시간: 10:00 ~ 16:00 \n\n ㅇ 개방전각: 집옥재·팔우정 \n\n ㅇ 관람방법: 경복궁 관람객 자유관람 \n\n\n < 관람 주의사항 안내 > \n\n ㅇ 안전관리 및 문화유산 보호를 위하여 전각 내부 입장 시 슬리퍼로 갈아신어야 합니다. \n\n ㅇ 집옥재 작은도서관의 모든 도서는 열람이 가능하며, 가지고 나가실 수 없습니다. (대출 불가) \n\n ㅇ 다른 관람객을 위해서 관람 질서를 지켜 주세요. \n\n ㅇ 집옥재 문화행사가 있는 날에는 내부 개방이 잠시 중지됩니다. (추후 공지사항 게시)",
      createDate: "2024-03-28",
    },
    {
      id: 15,
      name: "관리자",
      title:
        "경복궁 사정전 내부전시 개편 준비중에 따른 사정전 관람 안내(2024.4.9.~4.26.)",
      content:
        "경복궁 사정전 내부전시 개편 준비중입니다.\n양해 부탁드립니다. \n\n ※ 기간 : 2024.4.9.(화) ~4.26.(금)",
      createDate: "2024-04-09",
    },
    {
      id: 16, 
      name: "관리자",
      title: "2024 상반기 경복궁 야간관람 안내",
      content:
        "청량하고 따스한 봄바람과 도심 속 궁궐 야경이 있는 2024년 상반기 경복궁 야간관람에 여러분을 초대합니다. \n\n\n < 관람안내 > \n\n ￮ 관람기간: 2024. 5. 8.(수) ~ 6. 2.(일) \n ※ 야간관람 없는 날: 매주 월ㆍ화요일, 5.17.(금)~5.19.(일) \n\n ￮ 관람시간: 19:00 ~ 21:30 (입장마감 : 20:30) \n\n ￮ 관람인원: 1일 3,300명  - 인터넷 예매: 1일 3,000명(인터파크 티켓) \n ※ 1인당 최대 4매 이내 예매 가능 \n\n - 현장구매: 외국인 한정 1일 300명(당일권 선착순) \n ※ 1인당 최대 2매 이내 구매 가능 / 여권, 신분증 등 외국인 증빙자료 지참 \n\n - 무료관람: 입장 인원 제한 없음 \n ※ 무료관람대상자: 보호자와 동행한 만 6세 이하 영유아(단, 보호자는 사전예매 필수), 만 65세 이상 어르신, 한복 착용자, 국가유공자(보훈보상대상자 포함) 본인 및 배우자, 국가유족증 본인, 중증장애인 본인 및 동반 1인, 경증장애인 본인 \n ※ 외국인은 만 6세 이하 영유아, 만 65세 이상 어르신, 한복착용자 무료 \n ※ 무료관람대상자는 예매 불필요, 관련 신분증, 여권, 등록증 등 필히 지참하여 현장발권 없이 흥례문(표 받는 곳)에서 신분증 등 관련 자료 확인 후 입장 \n ※ 한복 착용자는 한복 무료관람 가이드라인에 따른 착용 여부 확인 후 입장 \n (한복 무료관람 가이드라인 바로가기) https://royal.khs.go.kr/ROYAL/contents/R705000000.do \n\n ￮ 관람요금 : 3,000원 \n\n ￮ 관람장소: 경복궁 광화문, 흥례문, 근정전, 경회루, 사정전, 강녕전, 고태전, 아미산 권역 \n\n\n < 예매안내 > \n\n ￮ 예매처 : 인터파크 티켓 \n ☞ 2024년 상반기 경복궁 야간관람 - 인터파크 (interpark.com) \n ※ 일부 인터넷 포털사이트 등에 잘못된 경복궁 야간관람 정보가 많으니 반드시 경복궁 누리집에서 관련 사항을 확인하시기 바랍니다. \n\n ￮ 인터넷 예매기간 : 2024. 4. 30.(화) 10:00 ~ 6. 1.(토) 23:59 \n ※ 관람일 1일 전까지 예매 가능, 관람 당일 예매 불가 \n ※ 사재기, 암표 판매 방지를 위해 전체 야간관람 기간 중 인터파크 ID 1개당 최대 4매만 구매 가능 \n ※ 티켓 예매 후, 관람 당일 광화문 매표소의 무인발권기에서 티켓 수령 후 입장 \n ※ 관람 1일 전 17:00까지 예매 취소 시 환불 가능 \n\n\n < 관람 유의사항 > \n\n- 야간관람은 외부 행사이며, 우천 시에도 정상 진행됩니다. \n\n - 우천 시 야외 활동에 대비해 우산 등을 준비하시기 바랍니다. \n\n - 구입한 예매권은 당일에 한해 유효합니다. \n\n- 야간관람 시 주변이 어두우므로 이동에 주의하여 주시기 바랍니다. \n\n ☎ 경복궁 야간관람 문의 : 경복궁관리소(02-3700-3900~1) \n ☏ 야간관람 인터넷 예매 관련 : 인터파크 티켓(1544-1555)",
      createDate: "2024-04-19",
    },
    {
      id: 17,
      name: "관리자",
      title: "2024 경복궁 경회루 특별관람 안내",
      content:
        "2024년 경회루 특별관람을 다음과 같이 안내드리며, 경회루에서 색다른 경복궁의 모습을 발견하는 시간이 되시기를 바랍니다. \n\n\n < 관람안내 > \n\n ㅇ 관람기간: 2024. 5. 8.(수) ~ 10. 31.(목) \n (상반기) 5월 8일(수) ~ 6월 30일(일) \n (하반기) 8월 1일(목) ~ 10월 31일(목) \n ※ 휴무: 매주 화요일, 법정공휴일, 7월 (혹서기) \n\n ㅇ 관람시간: 1일 4회(10시, 11시, 14시, 16시), 회당 약 40분 \n\n ㅇ 관람내용: 특별해설(한국어)과 함께 경회루 내부 관람(해설사 인솔하에 관람) \n\n ㅇ 관람요금: 무료(경복궁 입장료 별도) \n\n ㅇ 참여방법: 온라인 사전 예약(선착순) \n 경회루 특별관람 예약 바로가기 ☞ 경복궁관리소 (kguide.kr) \n\n\n < 예약안내 > \n\n ㅇ 예약인원: 회당 35명 (선착순) \n - 1인당 2석까지 예약 가능 (본인인증 후 예약, 중복예약 불가) \n - 만6세 이하 어린이 입장 또는 동행입장 불가(만7세부터 1인에 해당) \n\n ㅇ 예약기간: 관람일 7일 전 10:00 ~ 관람일 전일 23:59 (당일 예약 불가) \n ※ 상반기 예약시작일: 5월 1일(수) 10시 \n ※ 하반기 예약시작일: 7월 25일(목) 10시 \n\n ㅇ 취소기간: 관람일 7일 전 10:00 ~ 관람일 전일 23:59 (당일 취소 불가) \n ※ 비정상적인 방법으로 예약을 시도할 경우, 예고없이 취소될 수 있습니다. \n\n\n < 관람 유의사항 > \n\n ㅇ 예약자 예약확인 \n - 관람 대기장소: 경회루 함홍문(含弘門) 앞 \n - 예약확인: 관람시작 10분 전부터 확인 시작 \n - 확인방법: 예약자 예약확인증 제시 후 예약명단 확인(예약자 본인확인) \n\n ※ 해당 회차 관람 시작 후 입장 불가 \n ※ 예약확인은 관람 당일 예약자 현황을 기준으로 하며, 취소된 예약증을 소지하여 관람 요청할 수 없음 \n\n ㅇ 원활한 예약확인 및 입장을 위하여 관람시간 5분 전까지 도착해 주세요. \n\n ㅇ 예약 후 참여가 어려운 경우 반드시 취소해 주셔야 다른 사람이 참여할 수 있습니다. \n\n ㅇ 외국어 해설은 없습니다. \n\n ㅇ 경회루 2층 출입 시 문화유산 보호 및 안전관리를 위하여 제공된 슬리퍼를 착용하여야 합니다. \n\n ㅇ 회차당 잔여석 발생 시 잔여석 개수에 한하여 현장에서 대기 및 명단 작성 후 입장 가능합니다. \n\n ㅇ 경복궁 내부 사정에 따라 관람일정 등이 변경될 수 있습니다. \n\n ☎ 경회루 특별관람 문의: 경복궁관리소 02-3700-3900~1",
      createDate: "2024-04-20",
    },
    {
      id: 18,
      name: "관리자",
      title: "2024.4.22. (월) 지구의 날 행사에 따른 광화문 소등 알림",
      content:
        "지구환경오염 문제의 심각성을 알리기 위한 지구환경보호의 날을 맞아 광화문의 경관 조명을 다음과 같이 소등하오니 참고하시기 바랍니다. \n\n 1. 일 시 : 2024. 4. 22.(월) \n\n 2. 소등시간 : 20:00 ~ 20:10 (10분간)",
      createDate: "2024-04-22",
    },
    {
      id: 19,
      name: "관리자",
      title:
        "2024. 5. 21. (화) 경복궁에서 열리는 행사에 따른 경복궁 주차장 사용불가 안내",
      content:
        "2024. 5. 21. (화) 경복궁에서 열리는 행사로 인하여 경복궁 주차장 사용이 당일에 한해 불가하오니 양해하여 주시기 바랍니다. \n\n 일시  :  2024. 5. 21. (화) 06:00~23:00 \n ※ 경복궁 주차장 사용 불가",
      createDate: "2024-04-24",
    },
    {
      id: 20,
      name: "관리자",
      title: "2024 경복궁 집옥재 작은도서관 문화행사('오후의 필사') 3회차 안내",
      content:
        "경복궁관리소와 정독도서관이 함께하는 2024년 경복궁 집옥재 작은도서관 문화행사를 안내합니다. \n\n\n < 행사 소개 > \n\n ㅇ 행사명: '오후의 필사' (경복궁관리소-정독도서관 협업 프로그램) \n\n ㅇ 행사일정: 2024년 4월~6월, 9월~10월 셋째 주 목요일 14:00~16:00 (총 5회차) * 회차별 사전 공지 예정 \n ※ 9월에는 추석연휴로 첫째 주에 진행합니다. \n\n ㅇ 행사내용: 집옥재 작은도서관에서 독서 강의 및 필사 체험 진행 \n\n ㅇ 행사장소: 집옥재·팔우정(내부) \n\n ㅇ 모집인원: 회당 15명 \n\n ㅇ 참여방법: 정독도서관 홈페이지 선착순 사전접수(사전 회원가입 필요, 무료) \n\n\n < 3회차 안내 > \n\n ㅇ 행사일정: 2024년 6월 20일(목) 14:00 ~ 16:00 \n\n ㅇ 참여방법: 정독도서관 홈페이지 '회원가입' 후 선착순 접수(15명) \n - 접수 및 취소기간: 2024년 6월 3일(월) 9:00 ~ 6월 18일(화) 18:00 \n\n ★ 행사 안내 및 예약 페이지 ★ \n →  서울특별시교육청 정독도서관 > 프로그램 > 독서문화행사 (sen.go.kr) \n\n ㅇ 주제 : 필사란 무엇인가? (도서 : 나태주 「너무 잘하려고 애쓰지 마라」) \n\n ㅇ 대기장소: 행사시간 20분 전까지 국립민속박물관 정문 입구 쪽 경복궁 매표소 앞(백미당 맞은편, 외부) \n ※ 문화행사 운영일에는 집옥재 작은도서관 개방 시간이 다음과 같이 변경됩니다. \n\n\n < 6월 20일(목) 집옥재 작은도서관 개방 시간: 10:00 ~ 13:00 > \n ※ 문의번호: 02-2011-5772 ",
      createDate: "2024-06-01",
    }
  ]
};

const Reducer = (state, action)=>{
    switch(action.type){
        case "create":
            return{
                inputs: Contents.inputs,
                datas: state.datas.concat(action.data)
            }
        case "remove":
            return{
                ...state,
                datas: state.datas.filter((data)=>data.id !== action.id)
            }
        case "edit":
            return{
                ...state,
                datas: state.datas.map((data)=>data.id === action.id ?
                {...data, content: action.content} : data)
            }
        case "search":
            return{
                ...state,
                datas: state.datas.filter((data)=>{return(
                  data.title.includes(action.title) || data.content.includes(action.text)
                )})
            }
        default:
            return state
    }
}

export{
    Contents,
    Reducer
}