let FaqDb = {
    inputs : {
        idx: '',
        tit: '',
        txt: ''
    },
    datas : [
    {
        idx : 1,
        tit : '경복궁을 만드는 데 얼마나 걸렸을까?',
        txt : '뚝딱~ 뚝딱~ 태조 임금님이 새로운 나라 조선을 세우고 가장 먼저 시작한 일은 왕의 조상님들을 모시는 ‘종묘’를 짓고 왕실가족과 나랏일을 돕는 신하들이 머무르는 ‘궁궐’을 짓는 일이었습니다. 궁궐을 짓는데 걸린 시간은 10개월 정도였습니다. 궁궐 공사 이전에 먼저 땅을 잘 살피는 조사를 하였고 태조 3년(1395) 12월부터 공사를 시작하여 다음해 9월에 완성하였습니다.'
    },{
        idx : 2,
        tit : '경복궁과 중국의 자금성 중 어디가 더 클까? 또 무엇이 다를까?',
        txt : '경복궁과 중국의 자금성은 궁궐의 모습이 네모난 형태입니다. 그리고 남쪽에서 북쪽으로 중요한 건물들이 지어져 있고 양 옆에 건물들이 빼곡히 들어 서 있지요. 모두 웅장한 궁궐의 모습을 보여주면서 가지런히 정리된 건물들이 가득합니다. 그럼, 경복궁과 자금성은 서로 닮은 점만 있고 다른 점은 없을까요? 자금성은 폭이 넓고 깊이가 얕은 대신, 경복궁은 폭이 좁은 반면 깊이가 매우 깊다는 것이 다른 점입니다.'
    },{
        idx : 3,
        tit : '경복궁의 처음 모습은 어땠을까? 그리고, 지금과 무엇이 다를까?',
        txt : '처음에 경복궁 담장 안에 만들었던 건물이 약 755여 칸 정도라고 합니다. 경복궁 안에는 시간이 지나면서 건물들이 점점 늘어나게 됩니다. 경회루, 교태전 등이 추가로 지어진 건물들이죠. 임진왜란으로 불타버린 지 270여년 뒤인 고종 임금님 때 다시 지어집니다. 이 때는 7,700여칸 정도 되었답니다. 처음 경복궁을 지을 때와 비교해 보면 건물이 아주 많이 늘어난 셈이죠. 그 가운데 일제 침략기를 거치면서 1/10인 36동밖에 남아있지 않게 되었어요. 일제강점기 때 총독부 건물이 지어지고 야외 전시관으로 사용되면서 많은 건물들이 사라진 겁니다. 하지만 경복궁은 옛 모습을 되찾기 위해서 사라진 건물들을 1990년부터 다시 짓고 있어요. 원래 경복궁 뒤편에는 후원이 있었어요. 그 자리에 대통령이 계시는 청와대가 있습니다. 앞으로 더욱 멋진 경복궁의 모습을 볼 수 있을 겁니다.'
    },{
        idx : 4,
        tit : '궁궐의 건물 크기는 어떻게 계산할까?',
        txt : '지금은 건물의 넓이를 가로와 세로의 길이를 곱해서 표시하지만 옛날에는 기둥과 기둥 사이를 1칸으로 보고 그 칸 수를 세어서 넓이를 표시했어요. 예를 들어서 경복궁에서 가장 큰 건물인 근정전은 앞면의 기둥이 6개인데 기둥과 기둥 사이를 1칸이라고 하니깐 근정전의 앞면은 5칸이겠죠. 근정전 옆면도 기둥이 6개라서 옆면이 5칸입니다. 그래서 근정전 건물의 크기는 앞면 5칸에 옆면 5칸을 곱해서 모두 25칸 건물이 됩니다. 경복궁을 구경하면서 건물의 크기를 계산해 보는 것도 재미있겠죠?'
    },{
        idx : 5,
        tit : '청와대 자리도 원래 경복궁이었다는데 사실인가?',
        txt : '지금의 청와대 자리는 옛날에 경복궁 후원이 있던 자리입니다. 북쪽 문인 신무문 뒤로 후원이 있었는데 후원에서는 왕과 신하들이 활쏘기를 하거나 나라의 인재를 뽑는 과거시험 장소로 사용되었습니다. 일제강점기에 남산에 있던 총독부를 경복궁으로 옮겨 청사를 지으면서 일제침략자들은 총독이 살 집을 경복궁 후원에 지었습니다. 총독부를 경복궁에 지어 나라의 기운을 빼앗고 독립의 의지를 꺾으려고 하였습니다. 해방 후에 후원의 시설은 ‘경무대’로 이름을 바꾸어 대통령 사무실로 사용되었는데, 후에 새로 집을 짓고 ‘청와대’로 이름을 바꾸었으며, 총독이 살던 집은 헐어 버렸습니다.'
    },{
        idx : 6,
        tit : '경복궁은 왜 오랫동안 폐허로 있었나? ',
        txt : '임진왜란(1592)이 일어나면서 경복궁, 창덕궁, 창경궁 등 모든 궁궐이 불에 타버렸어요. 선조 임금님은 임시로 지금의 덕수궁에서 머물렀는데, 궁궐을 다시 지을 때 경복궁은 짓지 못하였습니다. 규모가 커서 재료와 인력을 동원하기 어렵다는 이유와 자리가 좋지 않다는 이유로 창덕궁과 창경궁을 먼저 짓게 됩니다. 이후에 약 270년 동안 계속 빈자리로 남아 있다가 고종 임금님때 대원군이 경복궁을 다시 지었어요.'
    },{
        idx : 7,
        tit : '한글은 어디서 만들어졌을까?',
        txt : '세종대왕과 집현전 학자들은 많은 사람들이 편리하게 글자를 사용하도록 ‘훈민정음’을 만들었어요. 다른 나라 글자들은 많은 세월이 지나면서 만들어지고 누가 만들었는지 정확히 알 수 없지요. 하지만 한글은 만든 사람들과 만든 시간을 알 수 있고 과학적이기 때문에 외국 사람들의 부러움을 사고 있어요. 그리고 한글은 훌륭한 문화유산으로 인정을 받아서 세계문화유산으로 등록되었지요.'
    },{
        idx : 8,
        tit : '대장금은 어디에서 요리를 했나?',
        txt : '대장금은 중종 때의 의녀입니다. 의녀는 아픈 사람의 병을 고치는 여자 의사를 말하죠. 대장금이 병을 잘 고치자 중종임금님은 대장금을 가까이 두고 병을 치료받고 싶었어요. TV 드라마 ‘대장금’에서 대장금은 의녀에서 궁중요리사로 변신하여 대단한 활약을 합니다. 그런데, <조선왕조실록> 책에는 대장금에 대해서 병을 치료하는 의녀의 기록만이 있어서 어떻게 궁중요리사가 되었고 또 어떻게 많은 활약을 했는지 잘 알 수는 없어요. 궁궐에는 왕실가족이 생활하는데 불편하지 않도록 옷을 만들고 음식을 요리하는 궁녀들이 있었어요. 궁녀들은 일을 나누어 궁궐에서 일을 했는데, 음식을 만드는 곳을 수라간이라고 합니다. 수라간에는 찬 음식을 만드는 생과방, 더운 음식을 만들고 잔치 때 떡과 음식을 만드는 소주방이 있었어요.'
    },{
        idx : 9,
        tit : '명성황후는 어디에서 시해되었나?',
        txt : '명성황후는 향원정 북쪽에 있는 건청궁 곤녕합에서 일본인들에게 시해되었어요. 일본은 조선을 지배하려고 했는데 명성황후가 러시아와 친하게 지내려고 하자 명성황후를 시해한 것이죠. 어떻게 일본은 경복궁에 들어와 명성황후를 시해했을까요? 1895년 10월 8일 새벽, 경복궁 광화문으로 들어와 근정전 서쪽 담장을 돌아서 경복궁 뒤편에 있는 건청궁으로 몰래 들어갔어요. 건청궁에는 임금님이 계시던 장안당과 명성황후가 계시던 곤녕합이 있었는데 일본인들이 곤녕합으로 가서 명성황후를 살해했다고 합니다. 명성황후가 숨을 거두자 건청궁 동쪽에 있던 언덕(녹산)에서 시체를 태우고 재는 향원정 연못에 버리고 타다남은 시신은 녹산에 묻었다고 합니다. 정말 끔찍한 일이죠. 궁궐을 침입하여 한 나라의 왕비를 죽인 일은 제국주의 일본의 야만성을 드러낸 것이지요.'
    },{
        idx : 10,
        tit : '우리나라에서 최초로 전깃불을 밝혔던 곳은 어디일까?',
        txt : '건청궁 앞에는 우리나라 최초로 전깃불을 사용하여 어두운 밤을 밝혔던 곳입니다. 우리나라 최초의 미국 유학생 유길준이 조선으로 돌아와서 고종 임금님에게 어두운 밤을 대낮같이 밝게 해주는 전구를 알려드립니다. 이 사실을 알기 7년 전에 미국의 발명왕 에디슨이 전깃불로 만든 전구를 발명했었죠. 고종은 미국의 에디슨 전기회사에게 전기공사를 맡기게 되었고 에디슨 전기회사는 건청궁 앞에 있는 연못(향원지)의 물을 끌어들여 전기를 만드는 발전소를 지었습니다. 경복궁에 전깃불이 들어온 것은 우리나라에서 처음이었고 일본과 중국보다도 2년 정도 빠른 것이었어요. 이러한 사실을 알려주기 위해 ‘한국의 전기발상지’ 글로 새긴 돌이 건청궁에 있습니다.'
    },{
        idx : 11,
        tit : '경회루 연못에서 용이 나왔다는데 사실인가?',
        txt : '경회루 연못에서 청동으로 만든 용(龍) 한 마리가 발견되었어요. 1997년에 경회루 연못을 청소하려고 물을 뺐을 때 발견되었는데 길이가 146.5㎝, 넓이가 14.2㎝, 무게가 66.5㎏입니다. 옛날부터 용은 물을 다스리고 비를 내리게 할 수 있는 신비한 동물로 생각되었답니다. 옛날 기록에 보면 경회루에 불이 나지 않도록 빌기 위해서 왕의 명령으로 연못 북쪽에 한 쌍(두 마리)의 용을 넣었는데, 그 중 한 마리의 용이 발견된 것입니다. 우리나라는 옛날에 나무로 건물을 지었어요. 나무는 불에 약하기 때문에 불이 나면 쉽게 타버립니다. 나무로 지어진 경회루가 불에 타지 않도록 바라는 마음에 비를 내리는 용을 연못에 넣어 둔 것이죠. 발견된 한 마리의 용은 지금은 경회루 연못이 아니라 국립고궁박물관에 전시 중입니다. 박물관에 찾아가서 용의 생김새를 보고 싶지 않나요?'
    },{
        idx : 12,
        tit : '근정전 월대에는 어떤 동물이 있나?',
        txt : '경복궁 근정전에 가면 동서남북을 지키는 상상의 동물 청룡·백호·주작·현무와 시간과 방향을 나타내고 지키는 12지신 가운데 쥐·소·호랑이·토끼·뱀·말·양·원숭이·닭 등을 볼 수 있어요. 경복궁 근정전은 나라의 중요한 행사가 열리던 곳입니다. 근정전의 정문인 근정문을 지나면 넓은 조정 마당이 보이고 바로 앞에는 커다란 근정전 건물이 있어요. 근정전 건물은 돌로 쌓은 월대 위에 지어져 더욱 웅장하게 보입니다. 조정을 지나 근정전 월대로 올라서면 계단 주위에 동물 조각이 있는 것을 볼 수 있어요. 동서남북을 지키는 청룡(동)·백호(서)·주작(남)·현무(북) 등이 있고 12지 동물들이 있습니다. 12지 동물들 중에서 개와 돼지는 보이지 않아요. 왜 그럴까요? 여러분이 나중에 커서 왜 개와 돼지가 없는지를 알려 준다면 많은 사람들이 좋아할 것입니다. 기대를 해도 될까요?'
    },{
        idx : 13,
        tit : '조선시대 임금의 하루일과는 어땠을까?',
        txt : '임금님은 무척 바쁜 하루를 보냅니다. 임금님이 해야 할 일은 만 가지 넘는다고 하는데, 임금님의 하루는 대개 어른들께 인사를 드리고 신하들을 만나서 나랏일을 의논합니다. 그리고 나라를 잘 다스리기 위해서 공부도 열심히 하셨지요. 하루에 3번 이상 공부하는 시간이 있었고 저녁 늦게 신하들을 불러서 궁금한 것을 묻기도 했어요. 임금님이 하시는 공부는 유교와 역사 공부를 많이 하셨어요. 가장 중요한 공부는 몸과 마음을 바르게 하는 것이었지요. 임금님의 하루는 조금씩 다를 수 있지만 시간별로 알아보면 임금님이 아침에 일어나시면 부모님께 잘 지내셨는지 인사를 드립니다. 그리고 아침 식사를 하기 전에 신하들을 만나고 공부를 하십니다. 아침을 드신 후에 어떤 일이 있었는지 신하들에게 이야기를 듣습니다. 점심시간이 되면, 간단하게 식사를 하시고 공부를 하세요. 그리고 지방으로 떠나는 신하들을 만나고 다른 일을 보십니다. 저녁에는 궁궐을 잘 지키기 위해서 밤을 새는 신하들이 누구인지 확인을 하고 궁궐에 들어오고 나갈 때 사용되는 암호를 정하기도 합니다. 저녁이 되면, 식사를 하시고 낮에 다 하지 못한 일들을 마무리 하시죠. 그리고 어른들께 잘 주무시라고 인사를 드립니다. 하루의 일을 마치시면 잠시 쉬기도 하지만 책을 읽거나 궁궐에 있는 신하를 불러서 궁금한 점을 물어보기도 합니다. 이렇게 하루를 마치면 편안히 잠자리에 드십니다.'
    },{
        idx : 14,
        tit : '조선시대 경복궁에는 몇 명이 살고 있었을까?',
        txt : '궁궐은 나라를 다스리는 왕과 그 가족들이 생활을 하던 곳입니다. 그리고 왕과 왕비를 도와서 여러 가지 일을 하는 사람들이 있었지요. 나랏일을 보는 관리, 왕실가족들이 생활하는데 불편하지 않도록 일을 하는 궁녀와 내시, 궁궐을 지키는 군인, 음식을 만드는 요리사와 병을 고치는 의사 등 많은 사람들이 궁궐에서 살거나 출입을 하면서 일을 했습니다. 그러면 경복궁에는 몇 명이 살고 있었을까요? 정확히는 알 수 없지만 대개 3000명 정도가 궁궐에서 살거나 궁궐을 드나들었다고 합니다. 왕실가족, 궁녀, 내시 등이 500명 정도이고 궁궐을 지키는 군인이 2,000명 정도 그리고 나랏일을 보는 신하들과 궁궐에서 일하는 사람이 500명 정도입니다.'
    },{
        idx : 15,
        tit : '조선시대 경복궁 관리들은 어디서 일했을까?',
        txt : '경복궁에는 임금님을 도와서 나랏일을 보는 관리들도 많이 있었어요. 남서쪽에 관리들의 사무실이 있었지요. 왕의 명령을 전달하는 승정원, 임금님이 나랏일을 결정할 때 도움을 주는 홍문관, 궁궐을 지키는 내병조 등 여러 관청들이 있었어요. 그리고 임금님과 왕실가족들의 건강을 책임지는 내의원과 음식을 맡은 사옹원, 옷을 담당하는 상의원 등이 있었어요.'
    }
]}
const reducer = (state, action)=>{
    switch(action.type){
        case "create" : //추가
            return{
                inputs : FaqDb.inputs,
                datas : state.datas.concat(action.data)
            }
        case "remove" : //삭제
            return{
                ...state,
                datas : state.datas.filter((item)=>item.idx !== action.idx)
            }
        case "edit" : //수정
            return{
                ...state,
                datas : state.datas.map((item)=>item.idx === action.idx ? {...item, tit:action.tit, text:action.txt} : item)
            }
        case "search" : //검색
            return{
                ...state,
                datas : state.datas.filter((item)=>{return(
                    item.tit.includes(action.text) ||
                    item.txt.includes(action.text)
                )})
            }
        default :
            return state
    }
}

export {FaqDb, reducer}